DataProcessors/упРМПланированиеРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМПланированиеРейсов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРасстоянияМеждуТочками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасстоянияМеждуТочками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяБазовое</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВоскресенье</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВторник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПонедельник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПятница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСреда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСуббота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЧетверг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьПростой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоматическийРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопыткаРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПытатьсяРассчитатьСнова</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НачальнаяШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачальнаяДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ограничение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОграниченияМаршрутизаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАдреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботВТочке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеОтклонениеУбытияИзТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоординаты</Name>
					<Comment>Представление широты и долготы в формате "34.451234;45.345666;"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМПланированиеРейсов/Forms/ФормаВыводаПроблемныхРасстояний/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.АдресТаблицыАдресов) Тогда
		ПериодАктуальности = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПериодАктуальностиРасчета");
		ОграниченияМаршрутизатора = упМаршрутизация.ПолучитьТаблицуОграниченийМаршрутизатора();
		ТекстЗапроса = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаАдресов.Адрес КАК Справочник.упАдреса) КАК Адрес,
		|	ТаблицаАдресов.ПриоритетноеПостроениеМассиваРасстояний КАК ПриоритетноеПостроениеМассиваРасстояний,
		|	ТаблицаАдресов.ДопОграниченияСитиГИД КАК ДопОграниченияСитиГИД
		|ПОМЕСТИТЬ ТаблицаАдресов
		|ИЗ
		|	&ТаблицаАдресов КАК ТаблицаАдресов
		|;ВЫБРАТЬ
		|	упГеографическиеЗоны.Ссылка КАК Зона,
		|	ТаблицаАдресов.Адрес КАК Адрес,
		|	ТаблицаАдресов.Адрес.Широта КАК Широта,
		|	ТаблицаАдресов.Адрес.Долгота КАК Долгота,
		|	МАКСИМУМ(ТаблицаАдресов.ПриоритетноеПостроениеМассиваРасстояний) КАК ПриоритетноеПостроениеМассиваРасстояний,
		|	МАКСИМУМ(ТаблицаАдресов.ДопОграниченияСитиГИД) КАК ДопОграниченияСитиГИД
		|ПОМЕСТИТЬ втТочки
		|ИЗ
		|	ТаблицаАдресов КАК ТаблицаАдресов
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны
		|		ПО упГеографическиеЗоны.Ссылка = упИерархияГеографическихЗон.Родитель
		|	ПО ТаблицаАдресов.Адрес.ГеографическаяЗона = упИерархияГеографическихЗон.Зона
		|ГДЕ ИСТИНА
		|	//И упГеографическиеЗоны.РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны
		|	И (ТаблицаАдресов.Адрес.Долгота <> 0
		|			ИЛИ ТаблицаАдресов.Адрес.Широта <> 0)
		|	И НЕ ТаблицаАдресов.Адрес.ПометкаУдаления
		|	И НЕ упГеографическиеЗоны.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	упГеографическиеЗоны.Ссылка,
		|	ТаблицаАдресов.Адрес
		|;
		|ВЫБРАТЬ ОграниченияМаршрутизатора.Ограничение ПОМЕСТИТЬ ОграниченияМаршрутизатора ИЗ &ОграниченияМаршрутизатора КАК ОграниченияМаршрутизатора
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТочкиНачальные.Адрес КАК АдресОтправления,
		|	втТочкиКонечные.Адрес КАК АдресПолучения,
		|	втТочкиНачальные.ДопОграниченияСитиГИД И втТочкиКонечные.ДопОграниченияСитиГИД КАК ДопОграниченияСитиГИД
		|ПОМЕСТИТЬ втРебра
		|ИЗ
		|	втТочки КАК втТочкиНачальные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТочки КАК втТочкиКонечные
		|		ПО втТочкиНачальные.Адрес <> втТочкиКонечные.Адрес
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АдресОтправления,
		|	АдресПолучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРебра.АдресОтправления,
		|	втРебра.АдресПолучения,
		|	ОграниченияМаршрутизатора.Ограничение,
		|	упРасстоянияМеждуТочками.ПопыткаРасчета,
		|	упРасстоянияМеждуТочками.Ошибка,
		|	ЕСТЬNULL(упРасстоянияМеждуТочками.ПытатьсяРассчитатьСнова, ИСТИНА) ПытатьсяРассчитатьСнова,
		|	ЕСТЬNULL(упРасстоянияМеждуТочками.АвтоматическийРасчет, ИСТИНА) АвтоматическийРасчет,
		|	ВЫБОР
		|		КОГДА упРасстоянияМеждуТочками.ПопыткаРасчета ЕСТЬ NULL ИЛИ упРасстоянияМеждуТочками.ПопыткаРасчета > 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеРассчитано,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(упРасстоянияМеждуТочками.ДатаИзменения, &ДатаРасчета) < &ДатаРасчета
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Просрочено,
		|	ВЫБОР
		|		КОГДА упРасстоянияМеждуТочками.АвтоматическийРасчет ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоискЗаписи
		|ПОМЕСТИТЬ втРезультат
		|ИЗ
		|	втРебра КАК втРебра
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОграниченияМаршрутизатора
		|	ПО (втРебра.ДопОграниченияСитиГИД)
		|		ИЛИ ОграниченияМаршрутизатора.Ограничение = ЗНАЧЕНИЕ(Перечисление.упОграниченияМаршрутизаторов.ПустаяСсылка)
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упРасстоянияМеждуТочками КАК упРасстоянияМеждуТочками
		|	ПО втРебра.АдресОтправления.Широта = упРасстоянияМеждуТочками.НачальнаяШирота
		|			И втРебра.АдресОтправления.Долгота = упРасстоянияМеждуТочками.НачальнаяДолгота
		|			И втРебра.АдресПолучения.Широта = упРасстоянияМеждуТочками.КонечнаяШирота
		|			И втРебра.АдресПолучения.Долгота = упРасстоянияМеждуТочками.КонечнаяДолгота
		|			И ОграниченияМаршрутизатора.Ограничение = упРасстоянияМеждуТочками.Ограничение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультат.*
		|ИЗ
		|	втРезультат КАК втРезультат";
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
		ЗапросПакета = ПакетЗапросов[ПакетЗапросов.Количество() - 1];
		Если Параметры.ВыводитьУстаревшие Тогда
			ЗапросПакета.Операторы[0].Отбор.Добавить("Просрочено > 0");
		Иначе
			ЗапросПакета.Операторы[0].Отбор.Добавить("НеРассчитано > 0");;
		КонецЕсли;
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаАдресов", ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыАдресов));
		Запрос.УстановитьПараметр("ОграниченияМаршрутизатора", ОграниченияМаршрутизатора);
		Если ПериодАктуальности = 0 Тогда 
			Запрос.УстановитьПараметр("ДатаРасчета", '00010101');
		Иначе	
			Запрос.УстановитьПараметр("ДатаРасчета", ТекущаяДатаСеанса() - (ПериодАктуальности * 86400));
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		

		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Список.Добавить(), Выборка);
			КонецЦикла; 
		КонецЕсли;
	Иначе
		ТаблицыПорций = ПолучитьИзВременногоХранилища(Параметры.АдресМассиваТаблицРасстояний).ТаблицыПорций;
		ТаблицаПарКоординат = РегистрыСведений.упРасстоянияМеждуТочками.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Для Каждого ТаблицаПорции Из ТаблицыПорций Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПорции, ТаблицаПарКоординат);
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.КонечнаяДолгота КАК КонечнаяДолгота,
		|	Т.КонечнаяШирота КАК КонечнаяШирота,
		|	Т.НачальнаяДолгота КАК НачальнаяДолгота,
		|	Т.НачальнаяШирота КАК НачальнаяШирота,
		|	Т.Ограничение КАК Ограничение
		|ПОМЕСТИТЬ ТаблицаПарКоординат
		|ИЗ
		|	&ТаблицаПарКоординат КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПарКоординат.АдресПолучения КАК АдресПолучения,
		|	ТаблицаПарКоординат.АдресОтправления КАК АдресОтправления,
		|	ТаблицаПарКоординат.Ограничение КАК Ограничение,
		|	ЕСТЬNULL(упРасстоянияМеждуТочкамиТ.ПопыткаРасчета, 0) КАК ПопыткаРасчета,
		|	ЕСТЬNULL(упРасстоянияМеждуТочкамиТ.ПытатьсяРассчитатьСнова, ИСТИНА) КАК ПытатьсяРассчитатьСнова,
		|	ЕСТЬNULL(упРасстоянияМеждуТочкамиТ.Ошибка, """") КАК Ошибка,
		|	ЕСТЬNULL(упРасстоянияМеждуТочкамиТ.АвтоматическийРасчет, ЛОЖЬ) КАК АвтоматическийРасчет,
		|	ВЫБОР
		|		КОГДА упРасстоянияМеждуТочкамиТ.АвтоматическийРасчет ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПоискЗаписи
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(КонечныйАдрес.Ссылка) КАК АдресПолучения,
		|		МАКСИМУМ(НачальныйАдрес.Ссылка) КАК АдресОтправления,
		|		ТаблицаПарКоординат.КонечнаяДолгота КАК КонечнаяДолгота,
		|		ТаблицаПарКоординат.КонечнаяШирота КАК КонечнаяШирота,
		|		ТаблицаПарКоординат.НачальнаяДолгота КАК НачальнаяДолгота,
		|		ТаблицаПарКоординат.НачальнаяШирота КАК НачальнаяШирота,
		|		ТаблицаПарКоординат.Ограничение КАК Ограничение
		|	ИЗ
		|		ТаблицаПарКоординат КАК ТаблицаПарКоординат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК КонечныйАдрес
		|			ПО (ИСТИНА)
		|				И (КонечныйАдрес.Долгота = ТаблицаПарКоординат.КонечнаяДолгота)
		|				И (КонечныйАдрес.Широта = ТаблицаПарКоординат.КонечнаяШирота)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК НачальныйАдрес
		|			ПО (ИСТИНА)
		|				И (НачальныйАдрес.Долгота = ТаблицаПарКоординат.НачальнаяДолгота)
		|				И (НачальныйАдрес.Широта = ТаблицаПарКоординат.НачальнаяШирота)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаПарКоординат.КонечнаяДолгота,
		|		ТаблицаПарКоординат.КонечнаяШирота,
		|		ТаблицаПарКоординат.НачальнаяДолгота,
		|		ТаблицаПарКоординат.НачальнаяШирота,
		|		ТаблицаПарКоординат.Ограничение) КАК ТаблицаПарКоординат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упРасстоянияМеждуТочками КАК упРасстоянияМеждуТочкамиТ
		|		ПО ТаблицаПарКоординат.КонечнаяДолгота = упРасстоянияМеждуТочкамиТ.КонечнаяДолгота
		|			И ТаблицаПарКоординат.КонечнаяШирота = упРасстоянияМеждуТочкамиТ.КонечнаяШирота
		|			И ТаблицаПарКоординат.НачальнаяДолгота = упРасстоянияМеждуТочкамиТ.НачальнаяДолгота
		|			И ТаблицаПарКоординат.НачальнаяШирота = упРасстоянияМеждуТочкамиТ.НачальнаяШирота
		|			И ТаблицаПарКоординат.Ограничение = упРасстоянияМеждуТочкамиТ.Ограничение";
		Запрос.УстановитьПараметр("ТаблицаПарКоординат", ТаблицаПарКоординат);
		Результат = Запрос.Выполнить().Выгрузить();
		Список.Загрузить(Результат);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Список.ТекущийЭлемент = Неопределено;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокПриАктивизацииПоля(Элемент)
	
	текСтрока = Элементы.Список.ТекущиеДанные;
	текЭлемент = Элементы.Список.ТекущийЭлемент;
	Если текСтрока <> Неопределено И текЭлемент <> Неопределено Тогда
		Если текЭлемент.Имя = "СписокПоискЗаписи" Тогда
			Если текСтрока.ПоискЗаписи = 0 Тогда
				текСтрока = Элементы.Список.ТекущиеДанные;
				сткПараметры = Новый Структура;
				сткОтбор = Новый Структура;
				сткДанные = упСервисныеФункцииВызовСервера.ЗначенияРеквизитовОбъекта(текСтрока.АдресОтправления, "Широта, Долгота");
				сткОтбор.Вставить("НачальнаяШирота", сткДанные.Широта);
				сткОтбор.Вставить("НачальнаяДолгота", сткДанные.Долгота);
				сткДанные = упСервисныеФункцииВызовСервера.ЗначенияРеквизитовОбъекта(текСтрока.АдресПолучения, "Широта, Долгота");
				сткОтбор.Вставить("КонечнаяШирота", сткДанные.Широта);
				сткОтбор.Вставить("КонечнаяДолгота", сткДанные.Долгота);
				сткОтбор.Вставить("Ограничение", текСтрока.Ограничение);
				сткПараметры.Вставить("Отбор", сткОтбор);
				ОткрытьФорму("РегистрСведений.упРасстоянияМеждуТочками.ФормаСписка", сткПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);				
			КонецЕсли; 
			Элементы.Список.ТекущийЭлемент = Элементы.СписокАдресОтправления;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Список.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле = Элементы.СписокАдресПолучения Тогда
		ПоказатьЗначение(,  ДанныеСтроки.АдресПолучения);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Поле = Элементы.СписокАдресОтправления Тогда
		ПоказатьЗначение(, ДанныеСтроки.АдресОтправления);
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
